Repository: AkinoKaede/AgentKit
Catalog: Localizations/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: OAuth authorization was declined.
ja: OAuth認可が拒否されました。
zh_hans: OAuth授权被拒绝。
zh_hant: OAuth授權遭拒。

source: OAuth requires secure HTTPS endpoints.
ja: OAuthには安全なHTTPSエンドポイントが必要です。
zh_hans: OAuth要求安全的HTTPS端点。
zh_hant: OAuth要求安全的HTTPS端點。

source: Sign in to this MCP server to continue.
ja: 続行するには、このMCPサーバにサインインしてください。
zh_hans: 登录此MCP服务器以继续。
zh_hant: 登入此MCP伺服器以繼續。

source: The MCP authorization challenge is invalid.
ja: MCP認可チャレンジが無効です。
zh_hans: MCP授权质询无效。
zh_hant: MCP授權查問無效。

source: The MCP request attempted an unsafe redirect.
ja: MCPリクエストが安全でないリダイレクトを試みました。
zh_hans: MCP请求尝试了不安全的重定向。
zh_hant: MCP要求嘗試了不安全的重新導向。

source: The OAuth authorization server identity changed.
ja: OAuth認可サーバの識別情報が変更されました。
zh_hans: OAuth授权服务器的身份已更改。
zh_hant: OAuth授權伺服器的身分已變更。

source: The OAuth callback could not be verified.
ja: OAuthコールバックを検証できませんでした。
zh_hans: 无法验证OAuth回调。
zh_hant: 無法驗證OAuth回呼。

source: The OAuth client authentication method is not supported.
ja: このOAuthクライアント認証方式には対応していません。
zh_hans: 不支持此OAuth客户端认证方式。
zh_hant: 不支援此OAuth用戶端驗證方式。

source: The OAuth resource does not match this MCP server.
ja: OAuthリソースがこのMCPサーバと一致しません。
zh_hans: OAuth资源与此MCP服务器不匹配。
zh_hant: OAuth資源與此MCP伺服器不相符。

source: The OAuth server does not support PKCE S256.
ja: OAuthサーバがPKCE S256に対応していません。
zh_hans: OAuth服务器不支持PKCE S256。
zh_hant: OAuth伺服器不支援PKCE S256。

source: The OAuth server metadata is invalid or unavailable.
ja: OAuthサーバのメタデータが無効か、取得できません。
zh_hans: OAuth服务器元数据无效或不可用。
zh_hant: OAuth伺服器中繼資料無效或無法使用。

source: The OAuth session expired. Sign in again to continue.
ja: OAuthセッションの有効期限が切れました。続行するには再度サインインしてください。
zh_hans: OAuth会话已过期，请重新登录以继续。
zh_hant: OAuth工作階段已到期，請重新登入以繼續。

source: The OAuth token request failed.
ja: OAuthトークンのリクエストに失敗しました。
zh_hans: OAuth令牌请求失败。
zh_hant: OAuth權杖要求失敗。

source: This MCP server requires a registered OAuth client ID.
ja: このMCPサーバには、登録済みのOAuthクライアントIDが必要です。
zh_hans: 此MCP服务器需要已注册的OAuth客户端ID。
zh_hant: 此MCP伺服器需要已註冊的OAuth用戶端ID。

source: %@ context
ja: コンテキスト%@
zh_hans: 上下文窗口%@
zh_hant: 內容窗口%@

source: %lld messages read
ja: %lld件のメッセージを読み取り済み
zh_hans: 已读取%lld条消息
zh_hant: 已讀取%lld則訊息

source: %lld models
ja: %lld個のモデル
zh_hans: %lld个模型
zh_hant: %lld個模型

source: Accepted
ja: 受付済み
zh_hans: 已接受
zh_hant: 已接受

source: Cancelled
ja: キャンセル済み
zh_hans: 已取消
zh_hant: 已取消

source: Completed
ja: 完了
zh_hans: 已完成
zh_hant: 已完成

source: Delivered
ja: 配信済み
zh_hans: 已送达
zh_hant: 已送達

source: Failed
ja: 失敗
zh_hans: 已失败
zh_hant: 已失敗

source: Idle
ja: アイドル
zh_hans: 空闲
zh_hant: 閒置

source: Interrupted
ja: 中断
zh_hans: 已中断
zh_hant: 已中斷

source: Preparing
ja: 準備中
zh_hans: 正在准备
zh_hant: 正在準備

source: Queued
ja: 待機中
zh_hans: 已排队
zh_hant: 已排入佇列

source: Reviewing
ja: レビュー中
zh_hans: 正在审核
zh_hant: 正在審核

source: Undelivered
ja: 未配信
zh_hans: 未送达
zh_hant: 未送達

source: Waiting for approval
ja: 承認待ち
zh_hans: 等待批准
zh_hant: 等待核准

source: Waiting for user
ja: ユーザの操作待ち
zh_hans: 等待用户
zh_hant: 等待使用者

source: Chat list unavailable
ja: チャット一覧を取得できません
zh_hans: 对话列表不可用
zh_hant: 對話列表無法使用

source: Chat status unavailable
ja: チャットの状態を取得できません
zh_hans: 对话状态不可用
zh_hant: 對話狀態無法使用

source: Chat unavailable
ja: チャットを利用できません
zh_hans: 对话不可用
zh_hant: 對話無法使用

source: Model list unavailable
ja: モデル一覧を取得できません
zh_hans: 模型列表不可用
zh_hant: 模型列表無法使用

source: No chats
ja: チャットはありません
zh_hans: 没有对话
zh_hant: 沒有對話

source: Provider
ja: プロバイダ
zh_hans: 提供商
zh_hant: 供應商

source: Wait stopped by user input
ja: ユーザの入力により待機を停止しました
zh_hans: 等待已因用户输入停止
zh_hant: 等待已因使用者輸入停止

source: Wait timed out
ja: 待機がタイムアウトしました
zh_hans: 等待超时
zh_hant: 等待逾時

source: Source URL
ja: 取得元URL
zh_hans: 来源URL
zh_hant: 來源URL

source: Resolved source
ja: 解決後の取得元
zh_hans: 解析后的来源
zh_hant: 解析後的來源

source: Commit
ja: コミット
zh_hans: 提交版本
zh_hant: 提交版本

source: Description
ja: 説明
zh_hans: 描述
zh_hant: 描述

source: Query
ja: 検索内容
zh_hans: 搜索内容
zh_hant: 搜尋內容

source: Conversation ID
ja: 会話ID
zh_hans: 会话标识
zh_hant: 對話識別碼

source: Offset
ja: 開始位置
zh_hans: 起始位置
zh_hant: 起始位置

source: Limit
ja: 件数の上限
zh_hans: 数量上限
zh_hant: 數量上限

source: Enabled
ja: 有効
zh_hans: 已启用
zh_hant: 已啟用

source: Matching text
ja: 一致するテキスト
zh_hans: 匹配文本
zh_hant: 比對文字

source: Replacement text
ja: 置換後のテキスト
zh_hans: 替换文本
zh_hant: 取代文字

source: No files
ja: ファイルはありません
zh_hans: 没有文件
zh_hant: 沒有檔案

source: More results are available
ja: さらに結果があります
zh_hans: 还有更多结果
zh_hant: 還有更多結果

source: Available on the next run
ja: 次回の実行から利用可能
zh_hans: 下次运行可用
zh_hant: 下次執行可用

source: Add memory
ja: メモリを追加
zh_hans: 新增记忆
zh_hant: 新增記憶

source: Replace memory
ja: メモリを置き換える
zh_hans: 替换记忆
zh_hant: 取代記憶

source: Remove memory
ja: メモリを削除
zh_hans: 移除记忆
zh_hant: 移除記憶

source: Create skill
ja: スキルを作成
zh_hans: 创建技能
zh_hant: 建立技能

source: Update skill
ja: スキルを更新
zh_hans: 更新技能
zh_hant: 更新技能

source: Patch skill
ja: スキルを修正
zh_hans: 修订技能
zh_hant: 修訂技能

source: Delete skill
ja: スキルを削除
zh_hans: 删除技能
zh_hant: 刪除技能

source: Set skill availability
ja: スキルの有効・無効を設定
zh_hans: 设置技能启用状态
zh_hant: 設定技能啟用狀態

source: Write skill file
ja: スキルのファイルを書き込む
zh_hans: 写入技能文件
zh_hant: 寫入技能檔案

source: Remove skill file
ja: スキルのファイルを削除
zh_hans: 移除技能文件
zh_hant: 移除技能檔案

source: Target
ja: 対象
zh_hans: 目标
zh_hant: 目標

source: User profile
ja: ユーザプロファイル
zh_hans: 用户资料
zh_hant: 使用者資料

source: memory
ja: メモリ
zh_hans: 记忆
zh_hant: 記憶

source: Binary resource. Export it from the skill editor to use its original bytes.
ja: バイナリリソースです。元のバイト列を使用するには、スキルエディタから書き出してください。
zh_hans: 这是二进制资源。请从技能编辑器导出以使用原始文件。
zh_hant: 這是二進位資源。請從技能編輯器匯出以使用原始檔案。

source: No lines returned
ja: テキスト行は返されませんでした
zh_hans: 未返回文本行
zh_hant: 未傳回文字行

source: Skills
ja: スキル
zh_hans: 技能
zh_hant: 技能

source: Disabled
ja: 無効
zh_hans: 已停用
zh_hant: 已停用

source: Read-only
ja: 読み取り専用
zh_hans: 只读
zh_hant: 唯讀

source: No skills available
ja: 利用可能なスキルはありません
zh_hans: 没有可用技能
zh_hant: 沒有可用技能

source: Skill changes saved
ja: スキルの変更を保存しました
zh_hans: 已保存技能变更
zh_hant: 已儲存技能變更

source: Skill installed
ja: スキルをインストールしました
zh_hans: 已安装技能
zh_hant: 已安裝技能

source: Memory operations processed
ja: メモリの操作を処理しました
zh_hans: 已处理记忆操作
zh_hant: 已處理記憶操作

source: Current memory
ja: 現在のメモリ
zh_hans: 当前记忆
zh_hant: 目前記憶

source: Recent conversations
ja: 最近の会話
zh_hans: 最近会话
zh_hant: 最近對話

source: Untitled conversation
ja: 名称未設定の会話
zh_hans: 未命名会话
zh_hant: 未命名對話

source: No conversations found
ja: 会話が見つかりませんでした
zh_hans: 未找到会话
zh_hant: 找不到對話

source: No messages found
ja: メッセージが見つかりませんでした
zh_hans: 未找到消息
zh_hant: 找不到訊息

source: User
ja: ユーザ
zh_hans: 用户
zh_hant: 使用者

source: Assistant
ja: アシスタント
zh_hans: 助手
zh_hant: 助理

source: Tool
ja: ツール
zh_hans: 工具
zh_hant: 工具

source: System
ja: システム
zh_hans: 系统
zh_hant: 系統

source: Message
ja: メッセージ
zh_hans: 消息
zh_hant: 訊息

source: Messages followed by tool activity cannot be edited.
ja: 後にツールの実行があるメッセージは編集できません。
zh_hans: 后续有工具活动的消息无法编辑。
zh_hant: 後續有工具活動的訊息無法編輯。

source: %@ failed (%lld): %@
ja: %1$@に失敗しました（%2$lld）：%3$@
zh_hans: %1$@失败（%2$lld）：%3$@
zh_hant: %1$@失敗（%2$lld）：%3$@

source: %@ is not a valid URL.
ja: %@は有効なURLではありません。
zh_hans: %@不是有效的URL。
zh_hant: %@不是有效的URL。

source: %@ is not a valid token endpoint.
ja: %@は有効なトークンエンドポイントではありません。
zh_hans: %@不是有效的令牌端点。
zh_hant: %@不是有效的權杖端點。

source: %@ is not an http or https URL.
ja: %@はHTTPまたはHTTPSのURLではありません。
zh_hans: %@不是HTTP或HTTPS URL。
zh_hant: %@不是HTTP或HTTPS URL。

source: %@ is unavailable while planning: nothing has been agreed to yet, so there is no work to track. Finish the plan and call present_plan.
ja: 計画中は%@を利用できません。まだ合意された内容がないため、追跡する作業がありません。計画を完成させ、present_planを呼び出してください。
zh_hans: %@在规划时不可用：尚未达成任何约定，因此没有需要跟踪的工作。请先完成计划并调用present_plan。
zh_hant: %@在規劃時不可用：尚未達成任何約定，因此沒有需要追蹤的工作。請先完成計畫並呼叫present_plan。

source: %lld edits applied
ja: %lld件の編集を適用しました
zh_hans: %lld应用的编辑
zh_hant: 已套用%lld項編輯

source: %lld entries
ja: %lld件
zh_hans: %lld条目
zh_hant: %lld個項目

source: %lld files
ja: %lld個のファイル
zh_hans: %lld个文件
zh_hant: %lld個檔案

source: %lld matching lines in %lld files
ja: %2$lld個のファイルで一致した%1$lld行
zh_hans: 在%2$lld个文件中找到%1$lld个匹配行
zh_hant: 在%2$lld個檔案中找到%1$lld個相符的行

source: %lld replacements applied
ja: %lldか所を置換しました
zh_hans: 已应用%lld处替换
zh_hant: 已套用%lld處取代

source: %lld results
ja: %lld件の結果
zh_hans: %lld个结果
zh_hant: %lld個結果

source: %lld tasks · %lld completed
ja: %1$lld件のタスク · %2$lld件完了
zh_hans: %1$lld个任务·已完成%2$lld个
zh_hant: %1$lld個任務·已完成%2$lld個

source: A skill may be at most %lld KB.
ja: スキルのサイズは%lld KB以下にしてください。
zh_hans: 技能最大为%lld KB。
zh_hant: 技能最大為%lld KB。

source: A skill name may be at most %lld characters.
ja: スキル名は%lld文字以内にしてください。
zh_hans: 技能名称最多%lld个字符。
zh_hant: 技能名稱最多%lld個字元。

source: A skill name may not begin or end with a hyphen.
ja: スキル名の先頭または末尾にハイフンは使用できません。
zh_hans: 技能名称不能以连字符开头或结尾。
zh_hant: 技能名稱不能以連字元開頭或結尾。

source: A skill name may not contain two hyphens in a row.
ja: スキル名にハイフンを2つ続けて使用することはできません。
zh_hans: 技能名称不能包含连续两个连字符。
zh_hant: 技能名稱不能包含連續兩個連字元。

source: A skill name may use only lowercase letters, digits, and hyphens.
ja: スキル名には小文字の英字、数字、ハイフンのみ使用できます。
zh_hans: 技能名称只能使用小写字母、数字和连字符。
zh_hant: 技能名稱只能使用小寫字母、數字和連字元。

source: A skill needs a description saying what it does and when to use it.
ja: スキルには、機能と使用場面を説明する記述が必要です。
zh_hans: 技能需要一段描述，说明它做什么以及何时使用。
zh_hant: 技能需要一段描述，說明它做什麼以及何時使用。

source: A skill needs a name.
ja: スキルには名前が必要です。
zh_hans: 技能需要一个名称。
zh_hant: 技能需要一個名稱。

source: A truncated model response contained tool calls; none were executed.
ja: 途中で切れたモデルの応答にツール呼び出しが含まれていました。どの呼び出しも実行されませんでした。
zh_hans: 截断的模型响应中包含工具调用，均未执行。
zh_hant: 截斷的模型回應中包含工具呼叫，均未執行。

source: Answer
ja: 回答
zh_hans: 回答
zh_hant: 回答

source: Answered in %lld ms
ja: %lldミリ秒で応答
zh_hans: 在%lld毫秒内答复
zh_hant: 於%lld毫秒內回覆

source: Approve for me
ja: 自動で承認
zh_hans: 帮我批准
zh_hant: 替我核准

source: Ask for approval
ja: 承認を求める
zh_hans: 请求批准
zh_hant: 要求核准

source: Attachments
ja: 添付ファイル
zh_hans: 附件
zh_hant: 附件

source: Audio
ja: 音声
zh_hans: 音频
zh_hant: 音訊

source: Automatic
ja: 自動
zh_hans: 自动
zh_hant: 自動

source: Case sensitive
ja: 大文字と小文字を区別
zh_hans: 区分大小写
zh_hant: 區分大小寫

source: Changes
ja: 変更
zh_hans: 变动
zh_hant: 變動

source: Classification
ja: 分類
zh_hans: 分类
zh_hant: 分類

source: Chat
ja: チャット
zh_hans: 对话
zh_hant: 對話

source: Command
ja: コマンド
zh_hans: 命令
zh_hant: 指令

source: Command Generator
ja: コマンドジェネレータ
zh_hans: 命令生成器
zh_hant: 指令產生器

source: Completed without output
ja: 完了しました（出力なし）
zh_hans: 已完成，无输出
zh_hant: 已完成，無輸出

source: Connecting
ja: 接続中
zh_hans: 正在连接
zh_hant: 正在連線

source: Consumer
ja: 利用ツール
zh_hans: 消费者
zh_hant: 消費者

source: Content
ja: 内容
zh_hans: 内容
zh_hant: 內容

source: Content type
ja: コンテンツの種類
zh_hans: 内容类型
zh_hant: 內容型別

source: Conversation
ja: 会話
zh_hans: 对话
zh_hant: 對話

source: Copied
ja: コピーしました
zh_hans: 已复制
zh_hant: 已複製

source: Created
ja: 作成済み
zh_hans: 已创建
zh_hant: 已建立

source: Critical
ja: 重大
zh_hans: 严重
zh_hant: 嚴重

source: Deleted
ja: 削除済み
zh_hans: 已删除
zh_hant: 已刪除

source: Destination
ja: 宛先
zh_hans: 目标
zh_hant: 目標

source: Diff
ja: 差分
zh_hans: 差异
zh_hant: 差異

source: Directory
ja: ディレクトリ
zh_hans: 目录
zh_hant: 目錄

source: Embedding
ja: 埋め込み
zh_hans: 嵌入
zh_hant: 嵌入

source: Empty file
ja: 空のファイル
zh_hans: 空文件
zh_hant: 空檔案

source: Exited
ja: 終了
zh_hans: 已退出
zh_hant: 已結束

source: Extra High
ja: 非常に高い
zh_hans: 极高
zh_hant: 極高

source: File
ja: ファイル
zh_hans: 文件
zh_hant: 檔案

source: Files
ja: ファイル
zh_hans: 文件
zh_hant: 檔案

source: Files are identical
ja: ファイルは同一です
zh_hans: 文件为相同的
zh_hant: 檔案內容相同

source: Format
ja: 形式
zh_hans: 格式
zh_hant: 格式

source: From
ja: 変更前
zh_hans: 从
zh_hant: 從

source: Full access
ja: フルアクセス
zh_hans: 完全访问权限
zh_hant: 完整存取權限

source: Google answered the sign-in without a token.
ja: Googleからのサインイン応答にトークンが含まれていませんでした。
zh_hans: Google完成了登录响应，但未返回令牌。
zh_hant: Google已完成登入回應，但未傳回權杖。

source: Google refused the sign-in — %@
ja: Googleがサインインを拒否しました — %@
zh_hans: Google拒绝登录：%@
zh_hant: Google拒絕登入：%@

source: High
ja: 高
zh_hans: 高
zh_hant: 高

source: Image
ja: 画像
zh_hans: 图像
zh_hant: 影像

source: Image Generation
ja: 画像生成
zh_hans: 图片生成
zh_hant: 影像產生

source: Imported as “%@”.
ja: 「%@」として読み込みました。
zh_hans: 已导入为“%@”。
zh_hant: 已匯入為「%@」。

source: Input
ja: 入力
zh_hans: 输入
zh_hant: 輸入

source: Kind
ja: 種類
zh_hans: 类型
zh_hant: 型別

source: Legacy transport using a GET stream and a separate POST endpoint.
ja: GETストリームと個別のPOSTエンドポイントを使用する旧方式です。
zh_hans: 旧版传输方式，使用GET流和单独的POST端点。
zh_hant: 舊版傳輸方式，使用GET串流和個別的POST端點。

source: Line %lld exceeds the %lld-byte page limit. Use a targeted byte slice or search.
ja: %1$lld行目が1ページあたり%2$lldバイトの上限を超えています。必要なバイト範囲を指定して読み取るか、検索してください。
zh_hans: 第%1$lld行超出每页%2$lld字节的限制。请按字节截取所需片段或搜索。
zh_hant: 第%1$lld行超出每頁%2$lld位元組的限制。請按位元組擷取所需片段或搜尋。

source: Line endings
ja: 改行コード
zh_hans: 行终
zh_hant: 行尾字元

source: Lines
ja: 行数
zh_hans: 行数
zh_hant: 行數

source: Low
ja: 低
zh_hans: 低
zh_hant: 低

source: Max
ja: 最大
zh_hans: 最高
zh_hant: 最高

source: Medium
ja: 中
zh_hans: 中
zh_hant: 中

source: Minimal
ja: 最小
zh_hans: 最低
zh_hant: 最低

source: Moved
ja: 移動済み
zh_hans: 已移动
zh_hant: 已移動

source: No
ja: いいえ
zh_hans: 否
zh_hant: 否

source: No Chat model is configured.
ja: チャット用モデルが設定されていません。
zh_hans: 尚未配置对话模型。
zh_hant: 尚未設定對話模型。

source: No differences
ja: 差分はありません
zh_hans: 无差别
zh_hant: 無差異

source: No matches
ja: 一致する項目はありません
zh_hans: 无匹配项
zh_hant: 沒有相符項目

source: No model is configured for conversation titles.
ja: 会話タイトル用のモデルが設定されていません。
zh_hans: 尚未为对话标题配置模型。
zh_hant: 尚未為對話標題設定模型。

source: No model list at this address. Check the base URL.
ja: このアドレスにモデル一覧がありません。ベースURLを確認してください。
zh_hans: 此地址没有模型列表，请检查基础URL。
zh_hant: 此位址沒有模型清單，請檢查基底URL。

source: No readable page content
ja: 読み取り可能なページ内容がありません
zh_hans: 没有可读的网页内容
zh_hant: 沒有可讀的網頁內容

source: No results
ja: 結果がありません
zh_hans: 无结果
zh_hant: 無結果

source: None
ja: なし
zh_hans: 无
zh_hant: 無

source: Off
ja: オフ
zh_hans: 关闭
zh_hant: 關閉

source: Original HTML
ja: 元のHTML
zh_hans: 原始HTML
zh_hant: 原始HTML

source: Overwrite
ja: 上書き
zh_hans: 覆盖
zh_hant: 覆寫

source: Overwritten
ja: 上書き済み
zh_hans: 覆盖
zh_hant: 已覆寫

source: Path
ja: パス
zh_hans: 路径
zh_hant: 路徑

source: Permissions
ja: アクセス権
zh_hans: 权限
zh_hant: 權限

source: Plan mode is on, so %@ was not run — it changes something outside this app. Investigate with reads, draft the plan in the scratch workspace, and call present_plan. The user runs it, or not, from there.
ja: 計画モードがオンのため、%@は実行されませんでした。この操作はアプリ外の内容を変更します。読み取りで調査し、一時ワークスペースに計画を作成してpresent_planを呼び出してください。その後、ユーザが実行するかどうかを判断します。
zh_hans: 计划模式已开启，因此未运行%@——它会更改本应用外部的内容。请先读取所需信息，在草稿工作区拟定计划并调用present_plan，由用户决定是否执行。
zh_hant: 計畫模式已開啟，因此未執行%@——它會更改本應用外部的內容。請先讀取所需資訊，在草稿工作區擬定計畫並呼叫present_plan，由使用者決定是否執行。

source: Plan presented from %@
ja: %@から計画を提示しました
zh_hans: 提交计划%@
zh_hant: 已從%@提交計畫

source: Purpose
ja: 目的
zh_hans: 目的
zh_hant: 目的

source: Question
ja: 質問
zh_hans: 问题
zh_hant: 問題

source: Question unavailable
ja: 質問を表示できません
zh_hans: 问题不可用
zh_hant: 問題不可用

source: Reasoning
ja: 推論
zh_hans: 推理
zh_hant: 推理

source: Remote path
ja: リモートパス
zh_hans: 遠端路徑
zh_hant: 远程路径

source: Replaced
ja: 置換済み
zh_hans: 已替换
zh_hant: 已取代

source: Request
ja: リクエスト
zh_hans: 请求
zh_hant: 請求

source: Rerank
ja: 再ランキング
zh_hans: 重排序
zh_hant: 重新排序

source: Result
ja: 結果
zh_hans: 结果
zh_hant: 結果

source: Reviews commands before automatic approval. Automatic selects the best available review model.
ja: 自動承認の前にコマンドをレビューします。「自動」では、利用可能な最適なレビューモデルを選択します。
zh_hans: 在自动批准前审查命令。自动模式会选择最佳的可用审查模型。
zh_hant: 在自動核准前審查指令。自動模式會選擇最佳的可用審查模型。

source: Running
ja: 実行中
zh_hans: 运行中
zh_hant: 執行中

source: SSE (legacy)
ja: SSE（旧方式）
zh_hans: SSE（旧版）
zh_hant: SSE（舊版）

source: Same as Chat
ja: チャットと同じ
zh_hans: 与对话模型相同
zh_hant: 與對話模型相同

source: Scratch path
ja: 一時保存パス
zh_hans: 草稿路径
zh_hant: 草稿路徑

source: Secret handle
ja: シークレットハンドル
zh_hans: 机密句柄
zh_hant: 機密句柄

source: Secret received securely
ja: シークレットを安全に受信しました
zh_hans: 已安全接收机密信息
zh_hant: 已安全接收機密資訊

source: Guardian
ja: ガーディアン
zh_hans: 监护者
zh_hant: 監護者

source: Auto-reviewing was cancelled; the action was not executed.
ja: 自動レビューがキャンセルされました。操作は実行されていません。
zh_hans: 自动审查已取消，操作未执行。
zh_hant: 自動審查已取消，操作未執行。

source: Auto-reviewing paused after repeated adverse results; the action was not executed.
ja: 不利な結果が繰り返されたため、自動レビューを一時停止しました。操作は実行されていません。
zh_hans: 自动审查因连续出现不利结果而暂停，操作未执行。
zh_hant: 自動審查因連續出現不利結果而暫停，操作未執行。

source: Auto-reviewing failed; the action was not executed. %@
ja: 自動レビューに失敗しました。操作は実行されていません。%@
zh_hans: 自动审查失败，操作未执行。%@
zh_hant: 自動審查失敗，操作未執行。%@

source: Auto-reviewing is unavailable; the action was not executed.
ja: 自動レビューを利用できません。操作は実行されていません。
zh_hans: 自动审查不可用，操作未执行。
zh_hant: 自動審查不可用，操作未執行。

source: Auto-reviewing returned an invalid decision.
ja: 自動レビューが無効な判断を返しました。
zh_hans: 自动审查返回了无效决定。
zh_hant: 自動審查傳回了無效決定。

source: Auto-reviewing timed out; the action was not executed.
ja: 自動レビューがタイムアウトしました。操作は実行されていません。
zh_hans: 自动审查超时，操作未执行。
zh_hant: 自動審查逾時，操作未執行。

source: Auto-reviewing exceeded its investigation limit.
ja: 自動レビューが調査回数の上限を超えました。
zh_hans: 自动审查超出了调查次数限制。
zh_hant: 自動審查超出了調查次數限制。

source: Auto-reviewing exceeded its reasoning turn limit.
ja: 自動レビューが推論ターン数の上限を超えました。
zh_hans: 自动审查超出了推理轮次限制。
zh_hant: 自動審查超出了推理輪次限制。

source: Showing %lld of %lld matching lines
ja: 一致した%2$lld行中%1$lld行を表示
zh_hans: 正在显示%1$lld/%2$lld个匹配行
zh_hant: 正在顯示%1$lld/%2$lld個匹配行

source: Signing failed: %@.
ja: 署名に失敗しました：%@。
zh_hans: 签名失败：%@。
zh_hant: 簽名失敗：%@。

source: Size
ja: サイズ
zh_hans: 大小
zh_hant: 大小

source: Skill
ja: スキル
zh_hans: 技能
zh_hant: 技能

source: Skipped
ja: スキップ済み
zh_hans: 跳过
zh_hant: 跳過

source: Skipped %lld binary files
ja: %lld個のバイナリファイルをスキップしました
zh_hans: 已跳过%lld个二进制文件
zh_hant: 已略過%lld個二進位檔案

source: Source
ja: 取得元
zh_hans: 来源
zh_hant: 來源

source: Status
ja: 状態
zh_hans: 状态
zh_hant: 狀態

source: Symlink
ja: シンボリックリンク
zh_hans: 符号链接
zh_hant: 符號連結

source: System prompt
ja: システムプロンプト
zh_hans: 系统提示
zh_hant: 系統提示

source: Text
ja: テキスト
zh_hans: 文本
zh_hant: 文字

source: Text is identical; line endings differ: %@ → %@
ja: テキストは同じですが、改行コードが異なります：%1$@ → %2$@
zh_hans: 文本相同，但换行符不同：%1$@→%2$@
zh_hant: 文字內容相同，但行尾字元不同：%1$@→%2$@

source: That is not a service account key. It needs client_email and private_key.
ja: サービスアカウントキーではありません。client_emailとprivate_keyが必要です。
zh_hans: 这不是有效的服务账户密钥，其中必须包含client_email和private_key。
zh_hant: 這不是有效的服務帳戶金鑰，其中必須包含client_email和private_key。

source: The Chat model has no available credential.
ja: チャット用モデルに利用可能な認証資格情報がありません。
zh_hans: 对话模型没有可用凭据。
zh_hant: 對話模型沒有可用認證資訊。

source: The app stopped before this tool call's result was recorded. Whether the action completed is unknown; check the current state before doing it again.
ja: このツール呼び出しの結果が記録される前に、アプリが停止しました。操作が完了したかは不明です。再実行する前に現在の状態を確認してください。
zh_hans: 应用在记录此工具调用结果前已停止。操作是否完成尚不确定；再次执行前请检查当前状态。
zh_hant: 應用在記錄此工具呼叫結果前已停止。操作是否完成尚不確定；再次執行前請檢查目前狀態。

source: The app stopped waiting for this tool before it finished. Whether the action completed is unknown; check the current state before doing it again.
ja: このツールが完了する前に、アプリが待機を停止しました。操作が完了したかは不明です。再実行する前に現在の状態を確認してください。
zh_hans: 应用在此工具完成前停止了等待。操作是否完成尚不确定；再次执行前请检查当前状态。
zh_hant: 應用在此工具完成前停止了等待。操作是否完成尚不確定；再次執行前請檢查目前狀態。

source: The conversation is too large to summarize.
ja: 会話が長すぎるため、要約できません。
zh_hans: 对话过长，无法生成摘要。
zh_hant: 對話過長，無法產生摘要。

source: The conversation no longer exists.
ja: この会話はもう存在しません。
zh_hans: 此对话已不存在。
zh_hant: 此對話已不存在。

source: The conversation-title model has no available credential.
ja: 会話タイトル用のモデルに利用可能な認証資格情報がありません。
zh_hans: 对话标题模型没有可用凭据。
zh_hant: 對話標題模型沒有可用認證資訊。

source: The current transport, using one endpoint for POST and GET.
ja: POSTとGETに同じエンドポイントを使用する現行の方式です。
zh_hans: 当前传输方式，使用同一端点处理POST和GET。
zh_hant: 目前傳輸方式，使用同一端點處理POST和GET。

source: The description is longer than %lld characters.
ja: 説明が%lld文字を超えています。
zh_hans: 描述超过%lld个字符。
zh_hant: 描述超過%lld個字元。

source: The differing region spans %lld lines, past the %lld-line diff limit. Narrow it with a bounded read of each side instead.
ja: 差分の範囲が%1$lld行あり、差分の上限の%2$lld行を超えています。それぞれのファイルを範囲を限定して読み取り、差分を絞り込んでください。
zh_hans: 差异区域跨越%1$lld行，超过%2$lld行的差异限制。请分别读取两侧的有限范围以缩小差异。
zh_hant: 差異區域跨越%1$lld行，超過%2$lld行的差異限制。請分別讀取兩側的有限範圍以縮小差異。

source: The endpoint answered %lld.
ja: エンドポイントが%lldを返しました。
zh_hans: 端点返回了%lld。
zh_hant: 端點傳回了%lld。

source: The endpoint answered, but not with a model list.
ja: エンドポイントは応答しましたが、モデル一覧を返しませんでした。
zh_hans: 端点已响应，但未返回模型列表。
zh_hant: 端點已回應，但未傳回模型清單。

source: The endpoint did not answer with HTTP.
ja: エンドポイントがHTTPで応答しませんでした。
zh_hans: 端点没有用HTTP回答。
zh_hant: 端點未以HTTP回應。

source: The endpoint rejected this key.
ja: エンドポイントがこのAPIキーを拒否しました。
zh_hans: 端点拒绝了此密钥。
zh_hant: 端點拒絕了此金鑰。

source: The event stream sent a line that exceeded the size limit.
ja: イベントストリームがサイズ上限を超える行を送信しました。
zh_hans: 事件流中的一行超过了大小限制。
zh_hant: 事件流中的一行超過了大小限制。

source: The file declared no name; “%@” was used.
ja: ファイルに名前の指定がなかったため、「%@」を使用しました。
zh_hans: 文件未声明名称，已使用“%@”。
zh_hant: 檔案未宣告名稱，已使用「%@」。

source: The fork could not be created because its identifier already exists.
ja: 識別子がすでに存在するため、分岐を作成できませんでした。
zh_hans: 无法创建分支，因为其标识符已存在。
zh_hant: 無法建立分支，因為其識別碼已存在。

source: The message is no longer available to edit.
ja: このメッセージは編集できなくなりました。
zh_hans: 该消息已无法编辑。
zh_hant: 該訊息已無法編輯。

source: The model did not return a usable summary.
ja: モデルが使用可能な要約を返しませんでした。
zh_hans: 该模型没有返回可用的摘要。
zh_hant: 模型未傳回可用的摘要。

source: The model connection closed before the response finished.
ja: 応答が完了する前に、モデルへの接続が閉じられました。
zh_hans: 模型连接在响应完成前已关闭。
zh_hant: 模型連線在回應完成前已關閉。

source: The model endpoint URL is invalid.
ja: モデルのエンドポイントURLが無効です。
zh_hans: 模型端点URL无效。
zh_hant: 模型端點URL無效。

source: The model endpoint did not return HTTP.
ja: モデルのエンドポイントがHTTP応答を返しませんでした。
zh_hans: 模型端点未返回HTTP响应。
zh_hant: 模型端點未傳回HTTP回應。

source: The model endpoint returned %lld: %@
ja: モデルのエンドポイントが%1$lldを返しました：%2$@
zh_hans: 模型端点返回%1$lld：%2$@
zh_hant: 模型端點傳回%1$lld：%2$@

source: The model endpoint returned an unsupported response format.
ja: モデルのエンドポイントが対応していない形式の応答を返しました。
zh_hans: 模型端点返回了不支持的响应格式。
zh_hant: 模型端點傳回了不支援的回應格式。

source: The model provider failed to complete the response.
ja: モデルプロバイダが応答を完了できませんでした。
zh_hans: 模型提供商未能完成响应。
zh_hant: 模型供應商未能完成回應。

source: The model response exceeded the size limit.
ja: モデルの応答がサイズの上限を超えました。
zh_hans: 模型响应超过了大小限制。
zh_hant: 模型回應超過了大小限制。

source: The model returned an invalid conversation title.
ja: モデルが無効な会話タイトルを返しました。
zh_hans: 该模型返回无效的对话标题。
zh_hant: 模型傳回了無效的對話標題。

source: The model returned an invalid tool call.
ja: モデルが無効なツール呼び出しを返しました。
zh_hans: 模型返回了无效的工具调用。
zh_hant: 模型傳回了無效的工具呼叫。

source: The model returned malformed JSON arguments for %@.
ja: モデルが%@に対して不正なJSON引数を返しました。
zh_hans: 模型为%@返回了格式错误的JSON参数。
zh_hant: 模型為%@傳回了格式錯誤的JSON參數。

source: The private key could not be read: %@.
ja: 秘密鍵を読み取れませんでした：%@。
zh_hans: 无法读取私钥：%@。
zh_hant: 無法讀取私密金鑰：%@。

source: The run was cancelled before this tool ran.
ja: このツールが実行される前に、今回の実行がキャンセルされました。
zh_hans: 此工具运行前的运行已被取消。
zh_hant: 此工具執行前的執行已被取消。

source: The secret is not valid for this host, tool, or purpose.
ja: このシークレットは、このホスト、ツール、用途には使用できません。
zh_hans: 此机密信息不适用于该主机、工具或用途。
zh_hant: 此機密資訊不適用於該主機、工具或用途。

source: The secret is unavailable or has already been used.
ja: このシークレットは利用できないか、すでに使用されています。
zh_hans: 此机密信息不可用或已被使用。
zh_hant: 此機密資訊不可用或已被使用。

source: The selected file window is not UTF-8 text.
ja: 選択したファイルの範囲はUTF-8テキストではありません。
zh_hans: 所选文件片段不是UTF-8文本。
zh_hant: 所選檔案片段不是UTF-8文字。

source: The server answered %lld to a Streamable HTTP request. It may only speak the legacy SSE transport — try switching Transport.
ja: Streamable HTTPリクエストに対し、サーバが%lldを返しました。旧方式のSSEトランスポートにのみ対応している可能性があります。トランスポートを切り替えてみてください。
zh_hans: 服务器对流式HTTP请求返回了%lld。它可能仅支持旧版SSE传输，请尝试切换传输方式。
zh_hant: 伺服器對流式HTTP請求傳回了%lld。它可能僅支援舊版SSE傳輸，請嘗試切換傳輸方式。

source: The server answered %lld.
ja: サーバが%lldを返しました。
zh_hans: 服务器返回了%lld。
zh_hant: 伺服器傳回了%lld。

source: The server closed the stream before answering.
ja: 応答する前にサーバがストリームを閉じました。
zh_hans: 服务器在回复前关闭流。
zh_hant: 伺服器在回覆前關閉流。

source: The server did not answer with HTTP.
ja: サーバがHTTPで応答しませんでした。
zh_hans: 服务器没有用HTTP回答。
zh_hant: 伺服器未以HTTP回應。

source: The server never answered %@.
ja: サーバが%@に応答しませんでした。
zh_hans: 服务器始终未响应%@。
zh_hant: 伺服器一律未回應%@。

source: The server's answer to %@ was not valid MCP.
ja: %@に対するサーバの応答は、有効なMCP形式ではありませんでした。
zh_hans: 服务器的答案%@无效MCP。
zh_hant: 伺服器對%@的回應不是有效的MCP內容。
